 <h1 style="text-align: center; color: RED">2.HAFTA CASE-2 ÇÖZÜMLERİ</h1>

 <h3 style="text-align: center; color: RED">Kural Tabanlı Sınıflandırma ile Potansiyel Müşteri Getirisi Hesaplama</h3>

<span style="color: blue; font-weight: bold;">İŞ PROBLEMİ</span> 

Bir oyun şirketi müşterilerinin bazı özelliklerini kullanarak seviye tabanlı (level based) yeni müşteri tanımları (persona)
oluşturmak ve bu yeni müşteri tanımlarına göre segmentler oluşturup bu segmentlere göre yeni gelebilecek müşterilerin şirkete
ortalama ne kadar kazandırabileceğini tahmin etmek istemektedir.

Örneğin: Türkiye’den IOS kullanıcısı olan 25 yaşındaki bir erkek kullanıcının ortalama ne kadar kazandırabileceği belirlenmek isteniyor.

<span style="color: blue; font-weight: bold;">VERİ SETİ HİKAYESİ</span> 

Persona.csv veri seti uluslararası bir oyun şirketinin sattığı ürünlerin fiyatlarını ve bu ürünleri satın alan kullanıcıların bazı demografik bilgilerini barındırmaktadır. Veri seti her satış işleminde oluşan kayıtlardan meydana gelmektedir. Bunun anlamı tablo tekilleştirilmemiştir. Diğer bir ifade ile belirli demografik özelliklere sahip bir kullanıcı birden fazla alışveriş yapmış olabilir. Değişkenler:

Price: Müşterinin harcama tutarı

Source: Müşterinin bağlandığı cihaz türü

Sex: Müşterinin cinsiyeti

Country: Müşterinin ülkesi

Age: Müşterinin yaşı

<span style="color: blue; font-weight: bold;">GÖREV -1</span>  Aşağıdaki soruları yanıtlayınız.

**Soru 1:** persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv("C:\\Users\\ASLI\\Desktop\\Data Scientist Bootcamp\\2.Veri Bilimi İçin Python Programlama\\dataset\\persona.csv")

In [22]:
def check_df(dataframe, head = 5):
    print('##############SHAPE##############')
    print(dataframe.shape)
    print('##############TYPES##############')
    print(dataframe.dtypes)
    print('##############COLUMNS#####################')
    print(dataframe.columns)
    print('##############HEAD######################')
    print(dataframe.head(head))
    print('##############TAİL#####################')
    print(dataframe.tail(head))
    print('##############DESCRİBE##########################')
    print(dataframe.describe([0, 0.05,0.25, 0.50,0.75, 0.95, 0.99, 1]).T)
    print('##############NULL#####################')
    print(dataframe.isnull().sum())
check_df(df)

##############SHAPE##############
(5000, 5)
##############TYPES##############
PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object
##############COLUMNS#####################
Index(['PRICE', 'SOURCE', 'SEX', 'COUNTRY', 'AGE'], dtype='object')
##############HEAD######################
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
##############TAİL#####################
      PRICE   SOURCE     SEX COUNTRY  AGE
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
##############DESCRİBE##########################
        count     mean        std   min    0%    5%   25%   50%   75%   95%  \
PRICE  5000.0  34.1320  12.464897   9.0   9.0  19.0  29.0  39.0  39.0  49.0
AGE    5000.0  23.5814   8.995908  15.0  15.0  15.0  17.0  21.0  27.0  43.0

        99%  100%   max
PRICE  59.0  59.0  59.0
AGE    53.0  66.0  66.0
##############NULL#####################
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64

**Soru 2:** Kaç unique SOURCE vardır? Frekansları nedir?

In [25]:
df['SOURCE'].unique()

array(['android', 'ios'], dtype=object)

In [29]:
df['SOURCE'].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

**Soru 3:** Kaç unique PRICE vardır?

In [33]:
df['PRICE'].unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [35]:
df['PRICE'].nunique()

6

**Soru 4:** Hangi PRICE'dan kaçar tane satış gerçekleşmiş?

In [39]:
df['PRICE'].value_counts()

PRICE
29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: count, dtype: int64

**Soru 5:**  Hangi ülkeden kaçar tane satış olmuş?

In [43]:
df['COUNTRY'].value_counts()

COUNTRY
usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: count, dtype: int64

**Soru 6:**  Ülkelere göre satışlardan toplam ne kadar kazanılmış?

In [49]:
df.groupby('COUNTRY')['PRICE'].sum()

COUNTRY
bra    51354
can     7730
deu    15485
fra    10177
tur    15689
usa    70225
Name: PRICE, dtype: int64

**Soru 7:**   SOURCE türlerine göre göre satış sayıları nedir?

In [54]:
df.groupby('SOURCE').agg({'PRICE':'count'})

         PRICE
SOURCE
android   2974
ios       2026

**Soru 8:** Ülkelere göre PRICE ortalamaları nedir?

In [58]:
df.groupby('COUNTRY').agg({'PRICE':'mean'})

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

**Soru 9:** SOURCE'lara göre PRICE ortalamaları nedir?

In [64]:
df.pivot_table(values = 'PRICE',index='SOURCE', aggfunc='mean')

             PRICE
SOURCE
android  34.174849
ios      34.069102

**Soru 10:** COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [69]:
df.pivot_table(values = 'PRICE',index=['SOURCE','COUNTRY'], aggfunc='mean')

                     PRICE
SOURCE  COUNTRY
android bra      34.387029
        can      33.330709
        deu      33.869888
        fra      34.312500
        tur      36.229437
        usa      33.760357
ios     bra      34.222222
        can      33.951456
        deu      34.268817
        fra      32.776224
        tur      33.272727
        usa      34.371703

<span style="color: blue; font-weight: bold;">GÖREV -2</span>  COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?

In [77]:
df.groupby(['COUNTRY','SOURCE','SEX','AGE']).agg({'PRICE':'mean'})

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

<span style="color: blue; font-weight: bold;">GÖREV-3</span> Çıktıyı PRICE'a göre sıralayınız.

In [93]:
agg_df = df.groupby(['COUNTRY','SOURCE','SEX','AGE']).agg({'PRICE':'mean'}).sort_values('PRICE', ascending =False)
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

<span style="color: blue; font-weight: bold;">GÖREV-4</span> Indekste yer alan isimleri değişken ismine çeviriniz.

In [95]:
agg_df = agg_df.reset_index()
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE
0       bra  android    male   46   59.0
1       usa  android    male   36   59.0
2       fra  android  female   24   59.0
3       usa      ios    male   32   54.0
4       deu  android  female   36   49.0
..      ...      ...     ...  ...    ...
343     usa      ios  female   38   19.0
344     usa      ios  female   30   19.0
345     can  android  female   27   19.0
346     fra  android    male   18   19.0
347     deu  android    male   26    9.0

[348 rows x 5 columns]

<span style="color: blue; font-weight: bold;">GÖREV-5</span> AGE değişkenini kategorik değişkene çeviriniz ve agg_df'e ekleyiniz.

In [111]:
agg_df['AGE_CAT'] = pd.cut(agg_df['AGE'],bins = [0,18,23,30,40,70], labels = ['0_18', '19_23', '24_30', '31_40', '41_70'])

In [113]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46   59.0   41_70
1     usa  android    male   36   59.0   31_40
2     fra  android  female   24   59.0   24_30
3     usa      ios    male   32   54.0   31_40
4     deu  android  female   36   49.0   31_40

<span style="color: blue; font-weight: bold;">GÖREV-6</span>  Yeni level based müşterileri tanımlayınız ve veri setine değişken olarak ekleyiniz.

Yeni eklenecek değişkenin adı: customers_level_based

Önceki soruda elde edeceğiniz çıktıdaki gözlemleri bir araya getirerek customers_level_baseddeğişkenini oluşturmanız gerekmektedir.

Dikkat! Listcomprehension ile customers_level_based değerleri oluşturulduktan sonra bu değerlerin tekilleştirilmesi gerekmektedir.  Örneğin birden fazla şu ifadeden olabilir: USA_ANDROID_MALE_0_18. Bunları groupby'aalıp priceortalamalarını almak gerekmektedir.

In [130]:
agg_df['customers_level_based '] = agg_df[['COUNTRY','SOURCE','SEX','AGE_CAT']].apply(lambda x : '_'.join(x).upper(), axis=1)

In [126]:
agg_df.values

array([['bra', 'android', 'male', 46, 59.0, '41_70'],
       ['usa', 'android', 'male', 36, 59.0, '31_40'],
       ['fra', 'android', 'female', 24, 59.0, '24_30'],
       ...,
       ['can', 'android', 'female', 27, 19.0, '24_30'],
       ['fra', 'android', 'male', 18, 19.0, '0_18'],
       ['deu', 'android', 'male', 26, 9.0, '24_30']], dtype=object)

In [138]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT    customers_level_based
0     bra  android    male   46   59.0   41_70    BRA_ANDROID_MALE_41_70
1     usa  android    male   36   59.0   31_40    USA_ANDROID_MALE_31_40
2     fra  android  female   24   59.0   24_30  FRA_ANDROID_FEMALE_24_30
3     usa      ios    male   32   54.0   31_40        USA_IOS_MALE_31_40
4     deu  android  female   36   49.0   31_40  DEU_ANDROID_FEMALE_31_40

In [151]:
agg_df = agg_df.groupby("customers_level_based ").agg({"PRICE": "mean"})

In [144]:
agg_df.head()

                              PRICE
customers_level_based
BRA_ANDROID_FEMALE_0_18   35.645303
BRA_ANDROID_FEMALE_19_23  34.077340
BRA_ANDROID_FEMALE_24_30  33.863946
BRA_ANDROID_FEMALE_31_40  34.898326
BRA_ANDROID_FEMALE_41_70  36.737179

In [153]:
agg_df  = agg_df.reset_index()
agg_df

       customers_level_based       PRICE
0     BRA_ANDROID_FEMALE_0_18  35.645303
1    BRA_ANDROID_FEMALE_19_23  34.077340
2    BRA_ANDROID_FEMALE_24_30  33.863946
3    BRA_ANDROID_FEMALE_31_40  34.898326
4    BRA_ANDROID_FEMALE_41_70  36.737179
..                        ...        ...
104         USA_IOS_MALE_0_18  33.983495
105        USA_IOS_MALE_19_23  34.901872
106        USA_IOS_MALE_24_30  34.838143
107        USA_IOS_MALE_31_40  36.206324
108        USA_IOS_MALE_41_70  35.750000

[109 rows x 2 columns]

<span style="color: blue; font-weight: bold;">GÖREV-7</span>  Yeni müşterileri (Örnek: USA_ANDROID_MALE_0_18) PRICE’a göre 4 segmente ayırınız.Segmentleri SEGMENT isimlendirmesi ile değişken olarak agg_df’e ekleyiniz. Segmentleri betimleyiniz (Segmentlere göre groupby yapıp price mean, max, sum’larını alınız)

In [162]:
agg_df['SEGMENT'] = pd.qcut(agg_df['PRICE'], 4, labels = ['D','C','B','A'])

In [164]:
agg_df.head()

     customers_level_based       PRICE SEGMENT
0   BRA_ANDROID_FEMALE_0_18  35.645303       B
1  BRA_ANDROID_FEMALE_19_23  34.077340       C
2  BRA_ANDROID_FEMALE_24_30  33.863946       C
3  BRA_ANDROID_FEMALE_31_40  34.898326       B
4  BRA_ANDROID_FEMALE_41_70  36.737179       A

<span style="color: blue; font-weight: bold;">GÖREV-8</span> Yeni gelen müşterileri sınıflandırınız ne kadar gelir getirebileceğini tahmin ediniz.

In [170]:
# 33 yaşında ANDROID kullanan bir Türk kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

new_user = "TUR_ANDROID_FEMALE_31_40"
agg_df[agg_df["customers_level_based "] == new_user]

      customers_level_based       PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40  41.833333       A

In [174]:
# 35 yaşında IOS kullanan bir Fransız kadını hangi segmente ve ortalama ne kadar gelir kazandırması beklenir?
new_user = "FRA_IOS_FEMALE_31_40"
agg_df[agg_df["customers_level_based "] == new_user]

   customers_level_based       PRICE SEGMENT
63   FRA_IOS_FEMALE_31_40  32.818182       C